
export const Data = [
  {
    id: 1,
    title: "起源",
    description:
      "　　從今年八月中思考轉職，到十月開始自學前端，原本是打算全部依靠網路資源來學習的，當時所設想的步驟，是一條簡單直接的學習路徑HTML > CSS > JS > VUE、REACT，然而在不斷探索前端的領域後，發覺並沒有想像中的單純簡單，前端涵蓋的領域之大，攤開來看是一張又深又廣的樹狀結構，小則網頁切版、RWD，大則效能優化，前後端整合，數據串接處理等，各種我所沒設想到學習路線，也開始思考，自己到底想成為什麼樣的前端工程師，並開始查詢市場上，針對轉職前端的課程，從中了解究竟甚麼樣的能力才是職場需要的，也在因緣際會下從PTT看到了AppWorks School的身影……",
  },
  {
    id: 2,

    title: "思考",
    description:
      "　　在閱讀了解完 AppWorks School 中 Coding Bootcamp 的整體架構與內容後，最初驚訝的還是全程免費這點，畢竟市面上的各種程式課程小則單堂$2000~5000，完整的培訓課程更是約都在 $50000 以上，對於目前的我是不小的負擔，再來則是發現，AppWorks School的內容偏向實務導向，以實際開發流程來訓練，且有專業的實戰面試與履歷輔導，跟市面一般的線上課程有很大的區別，也因此開始思考，究竟 AppWorks School 想要找尋且培訓的是什麼樣的人，而我是否擁有符合的特質與能力？",
  },
  {
    id: 3,

    title: "自學能力",
    description:
      "　　在過去，我有許多在網路上自學的經驗，如為了製作產品介紹影片，學習的剪輯與後製，在後來也成功找到了相關的實習，負責網路節目、廣告的後製剪輯，並擁有了個人與團隊接案的能力，以及為了讓畢業專題，跳脫以往都是實物拍攝的方式，學習了 3D 建模渲染等能力，提升展示產品的多樣性，專題最終也獲得  A’DESIGN銀獎、紅點概念設計入圍、IDEA工業設計入圍，並且成功進入到 3D設計的行業，就職期間，團隊時常會面對到不同的需求與難點，通常我都會先與PM一起溝通擬定方向，再去嘗試各種方法，當然也曾遇到過，先前完全沒有接觸的技術，好在公司會提供我邊做邊學的時間彈性，讓我從實作中摸索出學習的脈絡，同時增強自我學習的能力。",
  },

  {
    id: 4,

    title: "學習動力",
    description:
      "　　在過去自學 3D 設計的經驗中，本身有沒有想主動學習的動力，以及能在學習的過程中，感到有趣且富有成就感，是判斷能否掌握這項能力的關鍵，在自學前端的兩個月多，雖然有時面對這浩瀚的知識，常會疑惑自己真的有能力吸收嗎，但試著切分各項技術內容，循序作出網頁的各種部份，總能又讓我感到前端的魅力所在，就是因為他富含著廣大的知識領域，才讓我有想一步步往前探索征服的決心。",
  },
  {
    id: 5,

    title: "轉職決心",
    description:
      "　　因身邊剛好有從事前端，以及資工系的朋友，了解到工程師的工作彈性、福利制度，以及薪資結構，都比目前所處的行業還要有發展性，並有諮詢從事過前端的朋友，瞭解前端領域中的工作劃分與內容，且本身對於科技新知、區塊鏈領域也富有興趣，期望未來工作內容的方向，能與趨勢發展有更好的向性，綜合客觀分析與主觀了解後，前端領域是我想長期學習與嚮往的，對於轉職前端工程師抱有相當大的抱負。",
  },
  {
    id: 6,

    title: "職涯規劃",
    description:
      "　　目前以加入到金融、科技、區塊鏈等相關的新創公司為目標，一來是嚮往體驗新創公司的職業文化，二來也想讓自己有更多成長發揮的空間，期望可以協助開發到，具有創新且未來性的專案，累積實務開發經驗，並且持續加強，自身非本科系所缺乏的專業知識，始終保持學習心態，成為具有美感與創意，重視網頁效能優化，提高使用者體驗的前端工程師。",
  },
];
